/*
Шашки
1. Побудувати конкретний клас, з урахуванням необхідності приховання даних, в якому передбачити: конструктори, деструктор, 
	функції-модифікатори і функції-селектори. Функції-члени мають бути визначені за межами класу. Реалізувати вказану 
	дружню функцію.
	Клас “фігура”: координати на шахівниці, колір. Метод – “хід” – в одному з двох напрямків.
	Додаткові класи: “шашка” – (порядковий номер) і “дамка”, методи – “хід” і “удар”. Функцію “хід” визначити як дружню.

2. Клас «фігура»: координати на шахівниці, колір. Метод – «хід» – в одному з двох напрямків. Похідні класи: 
	«шашка» – (порядковий номер) і «дамка», методи – «хід» і «удар».
	В класах перевантажити бінарну функцію А/В як «А б’є В» і оператор перетворення типу (із «шашка» в «дамка»).
*/

#include <iostream>
#include "game.h"

using namespace std;

void main()
{
	setlocale(0, "");
	game myGame;
	myGame.playGame();

	system("pause");
}


/*
player pl;
int num;
char step = 'l';
while (true) {
pl.printCheckArr();
cout << "Enter num and step" << endl;
cin >> num;
cin >> step;
if (step != 'l' && step != 'r') break;
pl.step(num, step);
}
*/